tutorials/cases/canonical/conservation/chemistryGateCrossing/constant/reactions
species
(
    targas N2
);

reactions
(
);
