tutorials/cases/canonical/conservation/chemistryGateCrossing/0.orig/porosityF
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      porosityF;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

// Cell 0 holds 1 kg/m3 of solid and is reacted across criticalPorosity
// (0.9999) between t = 1.5 and t = 2. Cell 1 holds 500 kg/m3 and stays well
// below it for the whole run, so the chemistry never stops everywhere at once.
internalField   nonuniform List<scalar> 2 (0.999 0.5);

boundaryField
{
    wall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
